#+title: Contextual

  - Contextual :: depending on or relating to the circumstances that
    form the setting for an event, statement, or idea.


* About
  This library provides an ad hoc polymorphism/protocol system.  Its
  development was primarily motivated by an difficulty using monads in
  C++ with the degree of generality that is accomplished in Haskell and
  few other languages. However the implementation extends well beyond just
  monads and includes protocols for the following
    - semigroups
    - monoids
    - functors
    - applicative functors
    - monads
    - comonads
    - categories
    - arrows


* Work
** DONE Remove CTString
*** DONE Remove the ctstring tests tests
:LOGBOOK:
CLOCK: [2024-06-22 Sat 12:58]--[2024-06-22 Sat 12:59] =>  0:01
:END:

*** DONE Remove code supporting ctstrings
:LOGBOOK:
CLOCK: [2024-06-22 Sat 13:01]--[2024-06-22 Sat 13:05] =>  0:04
:END:

*** DONE Remove cmake references for ctstrings
:LOGBOOK:
CLOCK: [2024-06-22 Sat 13:05]--[2024-06-22 Sat 13:07] =>  0:02
:END:

** TODO Support for arrows
** TODO Migrate to Catch2
